In [15]:
import os
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import mysql.connector
%matplotlib inline

In [16]:
os.environ['db_user'] = 'root'
os.environ['db_pass'] = 'PinkFloyd@1988'

In [17]:
db_user = os.getenv('db_user')
db_password = os.getenv('db_pass')

In [18]:
print(db_user)
print(db_password)

root
PinkFloyd@1988

In [19]:
#building the connection
connection = mysql.connector.connect(host = 'localhost',
user = db_user,
passwd = db_password,
db = 'companydatabase')

In [20]:
connection

In [21]:
#let's now run some sql queries using pandas functionality
db_tables = pd.read_sql_query('SHOW TABLES FROM companydatabase',connection)
db_tables

C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\3260996746.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  db_tables = pd.read_sql_query('SHOW TABLES FROM companydatabase',connection)

  Tables_in_companydatabase
0                    branch
1           branch_supplier
2                    client
3                  employee
4                works_with

In [22]:
 #lets find out details of all tables
 tables = db_tables['Tables_in_companydatabase']

In [23]:
for i in tables:
    '''The output variable here will simply run a describe query in all of the tables in the database'''
    output = pd.read_sql_query('DESCRIBE {}'.format(i),connection)
    print(i)
    print(output,'\n')

branch
            Field            Type Null  Key Default Extra
0       branch_id          b'int'   NO  PRI    None
1     branch_name  b'varchar(40)'  YES         None
2          mgr_id          b'int'  YES  MUL    None
3  mgr_start_date         b'date'  YES         None

branch_supplier
           Field            Type Null  Key Default Extra
0      branch_id          b'int'   NO  PRI    None
1  supplier_name  b'varchar(40)'   NO  PRI    None
2    supply_type  b'varchar(40)'  YES         None

client
         Field            Type Null  Key Default Extra
0    client_id          b'int'   NO  PRI    None
1  client_name  b'varchar(40)'  YES         None
2    branch_id          b'int'  YES  MUL    None

employee
        Field            Type Null  Key Default Extra
0      emp_id          b'int'   NO  PRI    None
1  first_name  b'varchar(40)'  YES         None
2   last_name  b'varchar(40)'  YES         None
3   birth_day         b'date'  YES         None
4         sex   b'varchar(1)'  YES         None
5      salary          b'int'  YES         None
6    super_id          b'int'  YES  MUL    None
7   branch_id          b'int'  YES  MUL    None

works_with
         Field    Type Null  Key Default Extra
0       emp_id  b'int'   NO  PRI    None
1    client_id  b'int'   NO  PRI    None
2  total_sales  b'int'  YES         None

C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\3467833702.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  output = pd.read_sql_query('DESCRIBE {}'.format(i),connection)
C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\3467833702.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  output = pd.read_sql_query('DESCRIBE {}'.format(i),connection)
C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\3467833702.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  output = pd.read_sql_query('DESCRIBE {}'.format(i),connection)
C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\3467833702.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  output = pd.read_sql_query('DESCRIBE {}'.format(i),connection)
C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\3467833702.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  output = pd.read_sql_query('DESCRIBE {}'.format(i),connection)

In [24]:
db_tables

  Tables_in_companydatabase
0                    branch
1           branch_supplier
2                    client
3                  employee
4                works_with

In [25]:
branch = pd.read_sql_query('SELECT * FROM companydatabase.branch',connection)

C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\810306580.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  branch = pd.read_sql_query('SELECT * FROM companydatabase.branch',connection)

In [26]:
branch

   branch_id branch_name  mgr_id mgr_start_date
0          1   Corporate     100     2006-02-09
1          2    Scranton     102     1992-04-06
2          3    Stamford     106     1998-02-13

In [27]:
employees = pd.read_sql_query('SELECT * FROM companydatabase.employee',connection)
employees

C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\1055700210.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employees = pd.read_sql_query('SELECT * FROM companydatabase.employee',connection)

   emp_id first_name last_name   birth_day sex  salary  super_id  branch_id
0     100      David   Wallace  1967-11-17   M  250000       NaN          1
1     101        Jan  Levinson  1961-05-11   F  110000     100.0          1
2     102    Michael     Scott  1964-03-15   M   75000     100.0          2
3     103     Angela    Martin  1971-06-25   F   63000     102.0          2
4     104      Kelly    Kapoor  1980-02-05   F   55000     102.0          2
5     105    Stanley    Hudson  1958-02-19   M   69000     102.0          2
6     106       Josh    Porter  1969-09-05   M   78000     100.0          3
7     107       Andy   Bernard  1973-07-22   M   65000     106.0          3
8     108        Jim   Halpert  1978-10-01   M   71000     106.0          3

In [29]:
male_emp = pd.read_sql_query('SELECT * FROM companydatabase.employee WHERE sex = "M"',connection)
male_emp

C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\1998017949.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  male_emp = pd.read_sql_query('SELECT * FROM companydatabase.employee WHERE sex = "M"',connection)

   emp_id first_name last_name   birth_day sex  salary  super_id  branch_id
0     100      David   Wallace  1967-11-17   M  250000       NaN          1
1     102    Michael     Scott  1964-03-15   M   75000     100.0          2
2     105    Stanley    Hudson  1958-02-19   M   69000     102.0          2
3     106       Josh    Porter  1969-09-05   M   78000     100.0          3
4     107       Andy   Bernard  1973-07-22   M   65000     106.0          3
5     108        Jim   Halpert  1978-10-01   M   71000     106.0          3

In [30]:
emp_name_branch = pd.read_sql_query('SELECT first_name,branch_name FROM employee JOIN branch on employee.branch_id = branch.branch_id',connection)

C:\Users\sengu\AppData\Local\Temp\ipykernel_18452\4206982851.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  emp_name_branch = pd.read_sql_query('SELECT first_name,branch_name FROM employee JOIN branch on employee.branch_id = branch.branch_id',connection)

In [31]:
emp_name_branch

  first_name branch_name
0      David   Corporate
1        Jan   Corporate
2    Michael    Scranton
3     Angela    Scranton
4      Kelly    Scranton
5    Stanley    Scranton
6       Josh    Stamford
7       Andy    Stamford
8        Jim    Stamford